<template>
  <div class="container">
    <button>上一集</button>
    <button>下一集</button>
    <button @click="isActive = !isActive">选集</button>
    <collapse>
      <div v-show="isActive">
        <scroll class="video-choice">
          <ul>
            <h2>第1章 啊圣诞快乐放假啊圣诞快乐房价阿里山扩大</h2>
            <h2>第2章 啊圣诞快乐放假啊圣诞快乐房价阿里山扩大</h2>
            <h2>第3章 啊圣诞快乐放假啊圣诞快乐房价阿里山扩大</h2>
            <h2>第4章 啊圣诞快乐放假啊圣诞快乐房价阿里山扩大</h2>
            <h2>第5章 啊圣诞快乐放假啊圣诞快乐房价阿里山扩大</h2>
            <h2>第6章 啊圣诞快乐放假啊圣诞快乐房价阿里山扩大</h2>
            <h2>第7章 啊圣诞快乐放假啊圣诞快乐房价阿里山扩大</h2>
            <h2>第8章 啊圣诞快乐放假啊圣诞快乐房价阿里山扩大</h2>
            <h2>第9章 啊圣诞快乐放假啊圣诞快乐房价阿里山扩大</h2>
            <h2>第10章 啊圣诞快乐放假啊圣诞快乐房价阿里山扩大</h2>
            <h2>第11章 啊圣诞快乐放假啊圣诞快乐房价阿里山扩大</h2>
            <h2>第12章 啊圣诞快乐放假啊圣诞快乐房价阿里山扩大</h2>
            <h2>第13章 啊圣诞快乐放假啊圣诞快乐房价阿里山扩大</h2>
            <h2>第14章 啊圣诞快乐放假啊圣诞快乐房价阿里山扩大</h2>
            <h2>第15章 啊圣诞快乐放假啊圣诞快乐房价阿里山扩大</h2>
            <h2>第16章 啊圣诞快乐放假啊圣诞快乐房价阿里山扩大</h2>
            <h2>第17章 啊圣诞快乐放假啊圣诞快乐房价阿里山扩大</h2>
            <h2>第18章 啊圣诞快乐放假啊圣诞快乐房价阿里山扩大</h2>
            <h2>第19章 啊圣诞快乐放假啊圣诞快乐房价阿里山扩大</h2>
            <h2>第20章 啊圣诞快乐放假啊圣诞快乐房价阿里山扩大</h2>
            <h2>第21章 啊圣诞快乐放假啊圣诞快乐房价阿里山扩大</h2>
            <h2>第22章 啊圣诞快乐放假啊圣诞快乐房价阿里山扩大</h2>
            <h2>第23章 啊圣诞快乐放假啊圣诞快乐房价阿里山扩大</h2>
            <h2>第24章 啊圣诞快乐放假啊圣诞快乐房价阿里山扩大</h2>
            <h2>第25章 啊圣诞快乐放假啊圣诞快乐房价阿里山扩大</h2>
            <h2>第26章 啊圣诞快乐放假啊圣诞快乐房价阿里山扩大</h2>
            <h2>第27章 啊圣诞快乐放假啊圣诞快乐房价阿里山扩大</h2>
            <h2>第28章 啊圣诞快乐放假啊圣诞快乐房价阿里山扩大</h2>
            <h2>第29章 啊圣诞快乐放假啊圣诞快乐房价阿里山扩大</h2>
            <h2>第30章 啊圣诞快乐放假啊圣诞快乐房价阿里山扩大</h2>
            <h2>第31章 啊圣诞快乐放假啊圣诞快乐房价阿里山扩大</h2>
            <h2>第32章 啊圣诞快乐放假啊圣诞快乐房价阿里山扩大</h2>
            <h2>第33章 啊圣诞快乐放假啊圣诞快乐房价阿里山扩大</h2>
            <h2>第34章 啊圣诞快乐放假啊圣诞快乐房价阿里山扩大</h2>
            <h2>第35章 啊圣诞快乐放假啊圣诞快乐房价阿里山扩大</h2>
            <h2>第36章 啊圣诞快乐放假啊圣诞快乐房价阿里山扩大</h2>
            <h2>第37章 啊圣诞快乐放假啊圣诞快乐房价阿里山扩大</h2>
            <h2>第38章 啊圣诞快乐放假啊圣诞快乐房价阿里山扩大</h2>
            <h2>第39章 啊圣诞快乐放假啊圣诞快乐房价阿里山扩大</h2>
            <h2>第40章 啊圣诞快乐放假啊圣诞快乐房价阿里山扩大</h2>
            <h2>第41章 啊圣诞快乐放假啊圣诞快乐房价阿里山扩大</h2>
            <h2>第42章 啊圣诞快乐放假啊圣诞快乐房价阿里山扩大</h2>
            <h2>第43章 啊圣诞快乐放假啊圣诞快乐房价阿里山扩大</h2>
            <h2>第44章 啊圣诞快乐放假啊圣诞快乐房价阿里山扩大</h2>
            <h2>第45章 啊圣诞快乐放假啊圣诞快乐房价阿里山扩大</h2>
            <h2>第46章 啊圣诞快乐放假啊圣诞快乐房价阿里山扩大</h2>
            <h2>第47章 啊圣诞快乐放假啊圣诞快乐房价阿里山扩大</h2>
            <h2>第48章 啊圣诞快乐放假啊圣诞快乐房价阿里山扩大</h2>
            <h2>第49章 啊圣诞快乐放假啊圣诞快乐房价阿里山扩大</h2>
            <h2>第50章 啊圣诞快乐放假啊圣诞快乐房价阿里山扩大</h2>
          </ul>
        </scroll>
      </div>
    </collapse>
  </div>
</template>

<script>
import collapse from "@/assets/js/collapse";
import Scroll from "@/components/common/scroll/Scroll";
export default {
  data() {
    return {
      isActive: false
    };
  },
  components: {
    collapse,
    Scroll
  },
  mounted(){

  }

};

</script>

<style scoped>
.video-choice{
  border:1px solid #ddd;
  padding:10px;
  width:600px;
  height: 282px;
  text-align: center;
  overflow: hidden;
}
.video-choice{

}
.container{
  display: inline-block;
}
.container button{
  width: 100px;
  height:50px;
  margin-left: 100px;
}

</style>